/*
Мама мыла раму

Вывести на экран все возможные комбинации слов «Мама», «Мыла», «Раму».
Подсказка: их 6 штук. Каждую комбинацию вывести с новой строки. Слова не разделять.
 */
public class Task5 {
    public static void main(String[] args) {
        System.out.println("МылаРамуМама");
        System.out.println("РамуМамаМыла");
        System.out.println("МамаМылаРаму");
        System.out.println("МылаМамаРаму");
        System.out.println("РамуМылаМама");
        System.out.println("МамаРамуМыла");
    }
}
