/*
Жить хорошо, а хорошо жить еще лучше

Вывести на экран надпись «Жить хорошо, а хорошо жить еще лучше»
 */
public class Task15 {
    public static void main(String[] args) {
        System.out.println("Жить хорошо, а хорошо жить еще лучше");
    }
}
